src/cf/AccumulationRegisters/НДСПредъявленныйРеализация0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСПредъявленныйРеализация0</Name>
			<Comment>НДС предъявленный, реализация 0%</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПокупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуВА</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДССостоянияРеализация0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаВА</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаНДС</Name>
					<Comment>Субсчет 19 счета, на котором учитывается НДС</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьНоменклатуруПоОперациям0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/НДСПредъявленный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСПредъявленный</Name>
			<Comment> НДС, предъявляемый поставщиком</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПокупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаВА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуВА</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПриИмпорте</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаНДС</Name>
					<Comment>Субсчет 19 счета, на котором учитывается НДС</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ХранилищеДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/НДСПредъявленныйРеализация0/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления 3.0.78
// Функция для обработчика обновления.
// Обрабатывает остатки по регистру НДС предъявленный реализация 0, в которых не заполнено измерение Поставщик
// и заполняет значением из регистра НДС предъявленный 
Процедура ЗаполнитьПоставщикаПриОбновлении() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
	|	НДСПредъявленныйРеализация0Остатки.Состояние КАК Состояние,
	|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС КАК СчетУчетаНДС,
	|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ОстаткиПоСФ
	|ИЗ
	|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
	|			,
	|			Организация В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						НастройкиУчетаНДС.Организация КАК Организация
	|					ИЗ
	|						РегистрСведений.НастройкиУчетаНДС КАК НастройкиУчетаНДС
	|					ГДЕ
	|						НастройкиУчетаНДС.РаздельныйУчетНДСНаСчете19 = ИСТИНА)
	|				И (Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ИЛИ Поставщик = НЕОПРЕДЕЛЕНО)) КАК НДСПредъявленныйРеализация0Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоСФ.СчетФактура КАК СчетФактура,
	|	МАКСИМУМ(НДСПредъявленный.Поставщик) КАК Поставщик
	|ИЗ
	|	ОстаткиПоСФ КАК ОстаткиПоСФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|		ПО (НДСПредъявленный.СчетФактура = ОстаткиПоСФ.СчетФактура)
	|ГДЕ
	|	НДСПредъявленный.Активность = ИСТИНА
	|	И НЕ(НДСПредъявленный.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ИЛИ НДСПредъявленный.Поставщик = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоСФ.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НДСПредъявленныйРеализация0Обороты.Регистратор КАК Регистратор,
	|	НДСПредъявленныйРеализация0Обороты.СчетФактура КАК СчетФактура,
	|	НДСПредъявленныйРеализация0Обороты.Состояние КАК Состояние,
	|	НДСПредъявленныйРеализация0Обороты.ДокументОтгрузки КАК ДокументОтгрузки,
	|	НДСПредъявленныйРеализация0Обороты.СтавкаНДС КАК СтавкаНДС,
	|	НДСПредъявленныйРеализация0Обороты.СчетУчетаНДС КАК СчетУчетаНДС
	|ПОМЕСТИТЬ ОстаткиПоРегистраторам
	|ИЗ
	|	ОстаткиПоСФ КАК ОстаткиПоСФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленныйРеализация0.Обороты(, , Регистратор, ) КАК НДСПредъявленныйРеализация0Обороты
	|		ПО ОстаткиПоСФ.СчетФактура = НДСПредъявленныйРеализация0Обороты.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиПоРегистраторам.Регистратор КАК Регистратор
	|ИЗ
	|	ОстаткиПоРегистраторам КАК ОстаткиПоРегистраторам";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеПоСФ = РезультатыЗапроса[1].Выгрузить();
	ДанныеПоРегистраторам = РезультатыЗапроса[3].Выгрузить();
	
	Для каждого Строка Из ДанныеПоРегистраторам Цикл
		НаборЗаписейНДСПредъявленныйРеализация0 = СоздатьНаборЗаписей();
		НаборЗаписейНДСПредъявленныйРеализация0.Отбор.Регистратор.Установить(Строка.Регистратор);
		НаборЗаписейНДСПредъявленныйРеализация0.Прочитать();
		
		Для каждого СтрокаЗаписей Из НаборЗаписейНДСПредъявленныйРеализация0 Цикл
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("СчетФактура", СтрокаЗаписей.СчетФактура);
			ДанныеПоПоставщику = ДанныеПоСФ.НайтиСтроки(СтруктураОтбора);
			Если ДанныеПоПоставщику.Количество() > 0 Тогда
				СтрокаПоставщик = ДанныеПоПоставщику[0];
				СтрокаЗаписей.Поставщик = СтрокаПоставщик.Поставщик;
			КонецЕсли;
		КонецЦикла;
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейНДСПредъявленныйРеализация0, Истина);
		Исключение
			
			ШаблонСообщения = НСтр("ru = 'Не выполнено обновление записей регистра накопления ""НДС предъявленый реализация 0""
			|%1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыНакопления.НДСПредъявленныйРеализация0,,
			ТекстСообщения);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

// Обработчик обновления 3.0.78
// Функция для обработчика обновления.
// Обрабатывает движения по регистру НДС предъявленный реализация 0, в которых не заполнено измерение Поставщик
// и заполняет значением из регистра НДС предъявленный 
Процедура ЗаполнитьПоставщикаПриОбновленииОтложенно(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	Ключ = "НеПрименяетсяПоставщикДляРегистраНДСПредъявленныйРеализация0";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеДанных.Данные КАК Данные,
	|	ХранилищеДанных.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений.ХранилищеДанных КАК ХранилищеДанных
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ХранилищеДанных.Владелец) = ТИП(Справочник.Организации)";
	

	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	МассивОрганизацийДляИсключения = Новый Массив();
	Пока РезультатЗапроса.Следующий() Цикл
		Если ЗначениеЗаполнено(РезультатЗапроса.Данные) Тогда
			СохраненныеДанные = РезультатЗапроса.Данные.Получить();
			Если ЗначениеЗаполнено(СохраненныеДанные) И СохраненныеДанные.Свойство(Ключ) Тогда
				МассивОрганизацийДляИсключения.Добавить(РезультатЗапроса.Владелец);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	НДСПредъявленныйРеализация0.СчетФактура КАК СчетФактура,
	|	НДСПредъявленныйРеализация0.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ОстаткиПоСФ
	|ИЗ
	|	РегистрНакопления.НДСПредъявленныйРеализация0 КАК НДСПредъявленныйРеализация0
	|ГДЕ
	|	НДСПредъявленныйРеализация0.Организация В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				НастройкиУчетаНДС.Организация КАК Организация
	|			ИЗ
	|				РегистрСведений.НастройкиУчетаНДС КАК НастройкиУчетаНДС
	|			ГДЕ
	|				НастройкиУчетаНДС.РаздельныйУчетНДСНаСчете19 = ИСТИНА)
	|	И НЕ НДСПредъявленныйРеализация0.Организация В (&ОрганизацииИсключения)
	|	И (НДСПредъявленныйРеализация0.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ НДСПредъявленныйРеализация0.Поставщик = НЕОПРЕДЕЛЕНО)
	|	И НДСПредъявленныйРеализация0.Активность = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоСФ.СчетФактура КАК СчетФактура,
	|	МАКСИМУМ(НДСПредъявленный.Поставщик) КАК Поставщик,
	|	ОстаткиПоСФ.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ОстаткиПоСФСПоставщиком
	|ИЗ
	|	ОстаткиПоСФ КАК ОстаткиПоСФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|		ПО (НДСПредъявленный.СчетФактура = ОстаткиПоСФ.СчетФактура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоСФ.СчетФактура,
	|	ОстаткиПоСФ.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоСФСПоставщиком.СчетФактура КАК СчетФактура,
	|	ОстаткиПоСФСПоставщиком.Поставщик КАК Поставщик,
	|	ОстаткиПоСФСПоставщиком.Регистратор КАК Регистратор
	|ИЗ
	|	ОстаткиПоСФСПоставщиком КАК ОстаткиПоСФСПоставщиком
	|ГДЕ
	|	НЕ(ОстаткиПоСФСПоставщиком.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ИЛИ ОстаткиПоСФСПоставщиком.Поставщик = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоСФСПоставщиком.Регистратор КАК Регистратор
	|ИЗ
	|	ОстаткиПоСФСПоставщиком КАК ОстаткиПоСФСПоставщиком
	|ГДЕ
	|	НЕ(ОстаткиПоСФСПоставщиком.Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ИЛИ ОстаткиПоСФСПоставщиком.Поставщик = НЕОПРЕДЕЛЕНО)";
	
	Запрос.УстановитьПараметр("ОрганизацииИсключения", МассивОрганизацийДляИсключения);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДанныеПоСФ = РезультатыЗапроса[2].Выгрузить();
	ДанныеПоРегистраторам = РезультатыЗапроса[3].Выгрузить();
	
	Если ДанныеПоСФ.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Для каждого Строка Из ДанныеПоРегистраторам Цикл
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НДСПредъявленныйРеализация0.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Строка.Регистратор);
			Блокировка.Заблокировать();
			
			НаборЗаписейНДСПредъявленныйРеализация0 = РегистрыНакопления.НДСПредъявленныйРеализация0.СоздатьНаборЗаписей();
			НаборЗаписейНДСПредъявленныйРеализация0.Отбор.Регистратор.Установить(Строка.Регистратор);
			НаборЗаписейНДСПредъявленныйРеализация0.Прочитать();
			Для каждого СтрокаЗаписей Из НаборЗаписейНДСПредъявленныйРеализация0 Цикл
				
				СтруктураОтбора = Новый Структура();
				СтруктураОтбора.Вставить("СчетФактура", СтрокаЗаписей.СчетФактура);
				СтруктураОтбора.Вставить("Регистратор", СтрокаЗаписей.Регистратор);
				ДанныеПоПоставщику = ДанныеПоСФ.НайтиСтроки(СтруктураОтбора);
				Если ДанныеПоПоставщику.Количество() > 0 Тогда
					СтрокаПоставщик = ДанныеПоПоставщику[0];
					СтрокаЗаписей.Поставщик = СтрокаПоставщик.Поставщик;
				КонецЕсли;
				
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейНДСПредъявленныйРеализация0, Истина);
			
			ЗафиксироватьТранзакцию()
		Исключение
			ОтменитьТранзакцию();
			ШаблонСообщения = НСтр("ru = 'Не выполнено обновление записей регистра накопления ""НДС предъявленый реализация 0""
			|%1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыНакопления.НДСПредъявленныйРеализация0,,
			ТекстСообщения);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
